_app/_posts/soft/2016-04-11-在org-mode中插入源代码和ruby-highlight.html
---
layout: post
title: 在org-mode中插入源代码和ruby highlight
date: 2016-04-11
categories: 
- soft
tags: 
- org-mode
- highlight
- ruby
- begin_src
author: yefeiyu
excerpt: 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">设定</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>下述内容copy自wenshan</code><br  />
用 org-mode 记笔记、写博客（比如你现在看到的这篇）、做知识管理的时候，经常需要插入各种类型的源代码，于是我写了个小函数来简化这个过程。<br  />
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">1 org-mode 中的源代码块</h3>
<div class="outline-text-3" id="text-1-1">
<p>
这是一个 org-mode 中的 Elisp 代码块（可折叠）：<br  />
</p>
<pre class="example">
#+BEGIN_SRC emacs-lisp
  (message "天地玄黄，鸟生鱼汤")
#+END_SRC
</pre>
<p>
you can use <code>&lt;e Tab</code> create this.<br  />
注 ：在 Emacs 中，把光标置于源代码中间，按 M-x org-edit-src-code （我把它绑定到了 C-c s e ），就可以在相应的模式下编辑这段代码。<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">2 org-insert-src-block</h3>
<div class="outline-text-3" id="text-1-2">
<p>
为了不用自己输入 #+BEGIN<sub>SRC…</sub>#+END<sub>SRC</sub> 这一段，我写了下面这个Elisp 函数：<br  />
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">org-insert-src-block</span> (src-code-type)
    <span style="color: #8b2252;">"Insert a `</span><span style="color: #008b8b;">SRC-CODE-TYPE</span><span style="color: #8b2252;">' type source code block in org-mode."</span>
    (interactive
     (<span style="color: #a020f0;">let</span> ((src-code-types
            '(<span style="color: #8b2252;">"emacs-lisp"</span> <span style="color: #8b2252;">"python"</span> <span style="color: #8b2252;">"C"</span> <span style="color: #8b2252;">"sh"</span> <span style="color: #8b2252;">"java"</span> <span style="color: #8b2252;">"js"</span> <span style="color: #8b2252;">"clojure"</span> <span style="color: #8b2252;">"C++"</span> <span style="color: #8b2252;">"css"</span>
              <span style="color: #8b2252;">"calc"</span> <span style="color: #8b2252;">"asymptote"</span> <span style="color: #8b2252;">"dot"</span> <span style="color: #8b2252;">"gnuplot"</span> <span style="color: #8b2252;">"ledger"</span> <span style="color: #8b2252;">"lilypond"</span> <span style="color: #8b2252;">"mscgen"</span>
              <span style="color: #8b2252;">"octave"</span> <span style="color: #8b2252;">"oz"</span> <span style="color: #8b2252;">"plantuml"</span> <span style="color: #8b2252;">"R"</span> <span style="color: #8b2252;">"sass"</span> <span style="color: #8b2252;">"screen"</span> <span style="color: #8b2252;">"sql"</span> <span style="color: #8b2252;">"awk"</span> <span style="color: #8b2252;">"ditaa"</span>
              <span style="color: #8b2252;">"haskell"</span> <span style="color: #8b2252;">"latex"</span> <span style="color: #8b2252;">"lisp"</span> <span style="color: #8b2252;">"matlab"</span> <span style="color: #8b2252;">"ocaml"</span> <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"perl"</span> <span style="color: #8b2252;">"ruby"</span>
              <span style="color: #8b2252;">"scheme"</span> <span style="color: #8b2252;">"sqlite"</span>)))
       (list (ido-completing-read <span style="color: #8b2252;">"Source code type: "</span> src-code-types))))
    (<span style="color: #a020f0;">progn</span>
      (newline-and-indent)
      (insert (format <span style="color: #8b2252;">"#+BEGIN_SRC %s\n"</span> src-code-type))
      (newline-and-indent)
      (insert <span style="color: #8b2252;">"#+END_SRC\n"</span>)
      (previous-line 2)
      (org-edit-src-code)))
</pre>
</div>
<p>
eval 之，按 M-x org-insert-src-block ，然后输入代码类型（如 emacs-lisp，按 TAB可自动补全）即可。<br  />
注 感谢 李杀 关于 ido-completing-read 的帮助。<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">3  绑定快捷键</h3>
<div class="outline-text-3" id="text-1-3">
<p>
把 `C-c s i’ 绑定到这个函数，我的 org-mode-hook 设置如下：<br  />
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'org-mode-hook '(lambda ()
                              <span style="color: #b22222;">;; </span><span style="color: #b22222;">turn on flyspell-mode by default</span>
                              (flyspell-mode 1)
                              <span style="color: #b22222;">;; </span><span style="color: #b22222;">C-TAB for expanding</span>
                              (local-set-key (kbd <span style="color: #8b2252;">"C-&lt;tab&gt;"</span>)
                                             'yas/expand-from-trigger-key)
                              <span style="color: #b22222;">;; </span><span style="color: #b22222;">keybinding for editing source code blocks</span>
                              (local-set-key (kbd <span style="color: #8b2252;">"C-c s e"</span>)
                                             'org-edit-src-code)
                              <span style="color: #b22222;">;; </span><span style="color: #b22222;">keybinding for inserting code blocks</span>
                              (local-set-key (kbd <span style="color: #8b2252;">"C-c s i"</span>)
                                             'org-insert-src-block)
                              ))
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh">figlet <span style="color: #8b2252;">'china xing !'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">4 代码块中的语法高亮</h3>
<div class="outline-text-3" id="text-1-4">
<p>
把 org-src-fontify-natively 这个变量设为 t, 这样代码块里也会语法高亮 (需要 revert-buffer 来重新加载一下当前的 org 文件).<br  />
</p>
<div class="org-src-container">

<pre class="src src-c">(<span style="color: #228b22;">setq</span> <span style="color: #a0522d;">org</span>-src-fontify-natively t)
</pre>
</div>
<p>
org2blog 是利用 org-mode 的 export 引擎来把 org 文件转换成 HTML, 生成的HTML 中的代码块依然是语法高亮的.<br  />
需要注意的是, 生成的 HTML 中的语法高亮配色, 和你在 emacs 中看到的是一样的. 所以博客的配色和 emacs 的配色最好是接近的. 比如我在 emacs 用zenburn, 博客的配色也是类似于 zenburn (我自己改的 CSS). 否则你在emacs 看着很舒服的代码, 换个背景色, 可能就看着很难受了. 如果你的博客是浅色背景, 而在 emacs 中用的是深色背景, 那么在 M-xorg2blog/wp-post-buffer 之前, 最好换一个浅色主题, 比如 M-x load-themetango.<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">5 org-mode 支持的语言</h3>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">6 其他方案</h3>
<div class="outline-text-3" id="text-1-6">
<p>
感谢 Celad Evra 的提醒，org-mode 自带的 Easy Templates 也提供了快速插入代码块的功能： 输入 &lt;s TAB 即可（但不提供语言标识符的补全），具体细节请见 org-mode 的文档。<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">修改</h2>
<div class="outline-text-2" id="text-2">
<p>
简单的修改成highlight能认出的标记，添加文件头和尾。第一部分改成下述：<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup><br  />
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">org-insert-src-block</span> (src-code-type)
    <span style="color: #8b2252;">"Insert a `</span><span style="color: #008b8b;">SRC-CODE-TYPE</span><span style="color: #8b2252;">' type source code block in org-mode."</span>
    (<span style="color: #a020f0;">interactive</span>
     (<span style="color: #a020f0;">let</span> ((src-code-types
            '(<span style="color: #8b2252;">"emacs-lisp"</span> <span style="color: #8b2252;">"python"</span> <span style="color: #8b2252;">"C"</span> <span style="color: #8b2252;">"sh"</span> <span style="color: #8b2252;">"java"</span> <span style="color: #8b2252;">"js"</span> <span style="color: #8b2252;">"clojure"</span> <span style="color: #8b2252;">"C++"</span> <span style="color: #8b2252;">"css"</span>
              <span style="color: #8b2252;">"calc"</span> <span style="color: #8b2252;">"asymptote"</span> <span style="color: #8b2252;">"dot"</span> <span style="color: #8b2252;">"gnuplot"</span> <span style="color: #8b2252;">"ledger"</span> <span style="color: #8b2252;">"lilypond"</span> <span style="color: #8b2252;">"mscgen"</span>
              <span style="color: #8b2252;">"octave"</span> <span style="color: #8b2252;">"oz"</span> <span style="color: #8b2252;">"plantuml"</span> <span style="color: #8b2252;">"R"</span> <span style="color: #8b2252;">"sass"</span> <span style="color: #8b2252;">"screen"</span> <span style="color: #8b2252;">"sql"</span> <span style="color: #8b2252;">"awk"</span> <span style="color: #8b2252;">"ditaa"</span>
              <span style="color: #8b2252;">"haskell"</span> <span style="color: #8b2252;">"latex"</span> <span style="color: #8b2252;">"lisp"</span> <span style="color: #8b2252;">"matlab"</span> <span style="color: #8b2252;">"ocaml"</span> <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"perl"</span> <span style="color: #8b2252;">"ruby"</span>
              <span style="color: #8b2252;">"scheme"</span> <span style="color: #8b2252;">"sqlite"</span>)))
       (list (ido-completing-read <span style="color: #8b2252;">"Source code type: "</span> src-code-types))))
    (<span style="color: #a020f0;">progn</span>
      (newline-and-indent)
      (insert (format <span style="color: #8b2252;">"#+BEGIN_SRC %s\n"</span> src-code-type))
      (insert <span style="color: #8b2252;">"{&#30334;&#20998;&#21495;highlight ruby linenos "</span>)
      (insert <span style="color: #8b2252;">"%}\n"</span>)
      (newline-and-indent)
      (insert <span style="color: #8b2252;">"{&#30334;&#20998;&#21495; endhighlight "</span>)
      (insert <span style="color: #8b2252;">"%}\n"</span>)
      (insert <span style="color: #8b2252;">"#+END_SRC\n"</span>)
      (previous-line 2)
      (org-edit-src-code)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">其他方案</h2>
<div class="outline-text-2" id="text-3">
<p>
如果安装htmlize,则可以不用highlight控制颜色，使用org导出html的颜色。安装方法<br  />
</p>
<div class="org-src-container">

<pre class="src src-ruby">package-install
htmlize
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
换成英文%符号<br  />
</p></div>


</div>
</div>
